// Eyukin descent ladder.cpp 
#include <iostream>
#include <locale.h>
#include <stdlib.h>
using namespace std;
int main()
{
    setlocale(LC_ALL, "rus");
    cout << "---Программа расчета скидки!---" << endl;
    double summa = 0.0; //сумма покупки
    cout << "Введите сумму покупки: "; cin >> summa;
    if (summa <= 0.0)
    {
        cout << "Некорректная сумма!" << endl;
    }
    else //сработает, когда сумма больше нуля summa>0.0
    {
        if (summa >= 5000.0) //summa>=5000.0
        {
            cout << "Ваша скидка 25%, это максимальная скидка! К оплате: "
                << summa * 0.75 << " руб." << endl;
        }
        else //summa>=4000.0
        {
            if (summa >= 4000.0)   //4000...5000 
            {
                cout << "Ваша скидка 20%, до скидки в 25% не хватает "
                    << 5000.0 - summa << " руб. К оплате: " << summa * 0.8 << " руб." << endl;
            }
            else //summa>=3000.0
            {
                if (summa >= 3000.0) //3000...4000
                {
                    cout << "Ваша скидка 15%, до скидки в 20% не хватает "
                        << 4000.0 - summa << " руб. К оплате: " << summa * 0.85 << " руб." << endl;
                }
                else    //summa>=2000.0
                {
                    if (summa >= 2000.0) //2000...3000
                    {
                        cout << "Ваша скидка 10%, до скидки в 15% не хватает "
                            << 3000.0 - summa << " руб. К оплате: " << summa * 0.9 << " руб." << endl;
                    }
                    else    //summa>=1000.0
                    {
                        if (summa >= 1000.0) //1000...2000
                        {
                            cout << "Ваша скидка 5%, до скидки в 10% не хватает "
                                << 2000.0 - summa << " руб. К оплате: " << summa * 0.95 << " руб." << endl;
                        }
                        else   //summa<=1000.0
                        {
                            cout << "Ваша скидка 0%, до скидки в 5% не хватает "
                                << 1000.0 - summa << " руб. К оплате: " << summa << " руб." << endl;
                        }
                    }
                }
            }
        }
    }
    cout << "Для выхода из программы нажмите любую клавишу..." << endl;
    system("pause > NUL");
}
